[
  {
    "title": "Jollof Rice",
    "ingredients": "-4 tbsp neutral oil\n-2 large red onions\n-4 tbsp tomato paste\n-6 garlic cloves\n-1/4 inch ginger\n-1 scotch bonnet\n-4 large tomato\n-2 red bell peppers\n-2 cups washed basmati rice\n-use up to 1 cup boiling water (maybe less)\n-1 vegetable stock cube\n-1 tsp cumin/garlic/onion/oregano powder\n-1/2 tsp smoked paprika/chilli powder\n-bunch of fresh thyme\n-few bay leaves\n-big pinch of salt",
    "instructions": "-fry one thinly sliced red onion in veg oil on a low/medium heat for 15 minutes or until turning brown, add tomato paste then fry for another 5 minutes.\n-blend the other red onion, bell pepper, garlic, ginger, scotch bonnet and tomatoes, add to the pan along with the rest of the dried seasonings then simmer for 20 minutes, it will get darker, go thick and start splitting.\n-add boiling water (not too much) and washed rice then cover with parchment paper and the lid then simmer for 25 minutes on the lowest setting.\n-remove cover, mix then cover and cook for another 25 minutes. Turn off heat and leave covered to steam for another 15 minutes, fluff with a fork then serve and enjoy!",
    "image": "http://localhost:5000/uploads/1748019105240.jpg",
    "id": 2
  },
  {
    "title": "Creamy Coconut, Chickpea & Potato Curry",
    "ingredients": "Serves 4\n- 1 medium onion, diced\n- 3 tsp garlic granules \n- 1 & 1/2 tsp ground ginger\n- 2 tsp ground cumin\n- 2 tsp ground coriander \n- 1 tsp dried chilli flakes \n- 1 tsp of turmeric\n- 1/4 tsp ground cinnamon\n- 1/4 tsp nutmeg\n- 650g baby potatoes, halved\n- 1 large carrot, sliced\n- 500ml veggie stock\n- 1 can of chickpeas, drained & rinsed \n- 1/2 can full-fat coconut milk\n- salt & pepper to tasteServes 4\n- 1 medium onion, diced\n- 3 tsp garlic granules \n- 1 & 1/2 tsp ground ginger\n- 2 tsp ground cumin\n- 2 tsp ground coriander \n- 1 tsp dried chilli flakes \n- 1 tsp of turmeric\n- 1/4 tsp ground cinnamon\n- 1/4 tsp nutmeg\n- 650g baby potatoes, halved\n- 1 large carrot, sliced\n- 500ml veggie stock\n- 1 can of chickpeas, drained & rinsed \n- 1/2 can full-fat coconut milk\n- salt & pepper to taste",
    "instructions": "1. Cook onion in a large saucepan or pot using a little olive oil (or water for oil-free) on a medium heat setting for 8 mins until soft and translucent. \n\n2. Add all the spices including the garlic granules and cook for 1 minute until fragrant. \n\n3. Add the potatoes & carrot & chickpeas, then pour in the veg stock. \n\n4. Bring it all to a boil, give it a good stir, cover, and simmer on a lower heat setting for 15-20 minutes until the potatoes are soft enough to poke a fork through without breaking them apart. \n\n5. When the potatoes are soft, pour in the coconut milk, and cook for a further 15 minutes with the lid off until the liquid has reduced a little. \n\n6. Taste and season with your desired amount of salt and pepper. \n\n7. Serve with rice and enjoy!!",
    "image": "http://localhost:5000/uploads/1748019480507.jpg",
    "id": 3
  },
  {
    "title": "Flourless Brownies",
    "ingredients": "3 bananas (the darker the sweeter so please pick with a lot of brown spots)\n🌱 1/2 cup cacao (cacao is less processed than cocoa)\n🌱 1 cup almond butter (make a nice running consistency by thoroughly mixing it with the oils that separated)\n🌱 1/4 cup maple syrup (fully optional but if you like them quite sweet this is your way to go)\n🌱 Splash of vanilla (optional)😘",
    "instructions": "Combine all the ingredients and bake in a lined or greased baking dish (I used the one for baking bread) at 350°F for 25 minutes\nLet it cool off fully before cutting and serving.",
    "image": "http://localhost:5000/uploads/1748019995796.jpg",
    "id": 4
  },
  {
    "title": "Thai Red Noodle Soup",
    "ingredients": "1 onion\n1 carrot\n1 pepper\n4 garlic cloves\n1 thumb size piece of ginger\n1 lemongrass stalk\n4 tbsp Thai red curry paste\n400ml coconut milk\n750ml vegetable stock (add more if required)\n\n200g rice noodles\n200g firm tofu\n2 (lions mane) mushrooms\n2 tbsp soy sauce\n1 lime\nSmall bunch fresh coriander\nRed chilli\nSpring onion\n\nSalt\nPepper\nNeutral oil",
    "instructions": "1. Finely dice the carrot, onion + pepper.\n2. Mince the garlic + ginger, bash the lemongrass stalk.\n3. Add a splash of oil into a saucepan. On a medium high heat, add the carrot, onion + pepper with a pinch of salt. Sauté for 3-5 min until softened.\n4. Add the garlic, ginger + lemongrass. Sauté for 1 min until fragrant.\n5. Add the curry paste, mix well + allow to cook off for 2 min.\n6. Add the coconut milk, then hit veg stock. Bring to a boil then reduce to simmer for 10-15 min. Season to taste with salt, lime juice + sweetener of choice if required.\n7. For the toppings, in a hot pan sear + press out the moisture of the mushrooms. Add a splash of oil to coat + season with soy sauce.\n8. For the tofu, press out some moisture + slice into chunks.\n9. Coat well in cornflour + shallow fry in a glug of hot veg oil until golden + crisp on each side. Season with soy sauce.\n10. Cook the noodles according to indirections. Place into bowls, then top with ladles of broth. Add the mushroom, tofu + coriander on top. Garnish with chilli, spring onion + a wedge of lime - enjoy!",
    "image": "http://localhost:5000/uploads/1748020152587.jpg",
    "id": 5
  },
  {
    "title": "Chocolate Cupcakes And Peanut Butter Icing",
    "ingredients": "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature\n\n2/3 cup granulated sugar\n\n2/3 cup light brown sugar, packed\n\n2 extra-large eggs, at room temperature\n\n2 teaspoons pure vanilla extract\n\n1 cup buttermilk, shaken, at room temperature\n\n1/2 cup sour cream, at room temperature\n \n\n2 tablespoons brewed coffee\n\n1 3/4 cups all-purpose flour\n\n1 cup good cocoa powder\n\n1 1/2 teaspoons baking soda\n\n1/2 teaspoon kosher salt\n\nKathleen's Peanut Butter Icing, recipe follows\n\nChopped salted peanuts, to decorate, optional\nKathleen's Peanut Butter Icing:\n\n1 cup confectioners' sugar\n\n1 cup creamy peanut butter\n\n5 tablespoons unsalted butter, at room temperature\n\n3/4 teaspoon pure vanilla extract\n\n1/4 teaspoon kosher salt\n\n1/3 cup heavy cream",
    "instructions": "Preheat the oven to 350 degrees F. Line cupcake pans with paper liners.\nIn the bowl of an electric mixer fitted with a paddle attachment, cream the butter and 2 sugars on high speed until light and fluffy, approximately 5 minutes. Lower the speed to medium, add the eggs 1 at a time, then add the vanilla and mix well. In a separate bowl, whisk together the buttermilk, sour cream, and coffee. In another bowl, sift together the flour, cocoa, baking soda, and salt. On low speed, add the buttermilk mixture and the flour mixture alternately in thirds to the mixer bowl, beginning with the buttermilk mixture and ending with the flour mixture. Mix only until blended. Fold the batter with a rubber spatula to be sure it's completely blended.\nDivide the batter among the cupcake pans (1 rounded standard ice cream scoop per cup is the right amount). Bake in the middle of the oven for 20 to 25 minutes, until a toothpick comes out clean. Cool for 10 minutes, remove from the pans, and allow to cool completely before frosting.\nFrost each cupcake with Peanut Butter Icing and sprinkle with chopped peanuts, if desired.\nKathleen's Peanut Butter Icing:\n\nPlace the confectioners' sugar, peanut butter, butter, vanilla, and salt in the bowl of an electric mixer fitted with a paddle attachment. Mix on medium-low speed until creamy, scraping down the bowl with a rubber spatula as you work. Add the cream and beat on high speed until the mixture is light and smooth.Preheat the oven to 350 degrees F. Line cupcake pans with paper liners.\nIn the bowl of an electric mixer fitted with a paddle attachment, cream the butter and 2 sugars on high speed until light and fluffy, approximately 5 minutes. Lower the speed to medium, add the eggs 1 at a time, then add the vanilla and mix well. In a separate bowl, whisk together the buttermilk, sour cream, and coffee. In another bowl, sift together the flour, cocoa, baking soda, and salt. On low speed, add the buttermilk mixture and the flour mixture alternately in thirds to the mixer bowl, beginning with the buttermilk mixture and ending with the flour mixture. Mix only until blended. Fold the batter with a rubber spatula to be sure it's completely blended.\nDivide the batter among the cupcake pans (1 rounded standard ice cream scoop per cup is the right amount). Bake in the middle of the oven for 20 to 25 minutes, until a toothpick comes out clean. Cool for 10 minutes, remove from the pans, and allow to cool completely before frosting.\nFrost each cupcake with Peanut Butter Icing and sprinkle with chopped peanuts, if desired.\nKathleen's Peanut Butter Icing:\n\nPlace the confectioners' sugar, peanut butter, butter, vanilla, and salt in the bowl of an electric mixer fitted with a paddle attachment. Mix on medium-low speed until creamy, scraping down the bowl with a rubber spatula as you work. Add the cream and beat on high speed until the mixture is light and smooth.",
    "image": "http://localhost:5000/uploads/1748020490073.jpeg",
    "id": 6
  },
  {
    "title": "No Bake Blueberry Lemon Cheesecake",
    "ingredients": "For the crust:\n2 cups raw almonds\n1/4 tsp salt\n3 tbsp maple syrup\n\nFor the filling:\n2 cups soaked cashews\n1/2 cup coconut cream\n1/2 cup maple syrup\n1/4 cup lemon juice\n1 tsp vanilla\n1 cup blueberries",
    "instructions": "Start by pulsing the almonds, maple syrup & salt until you reach a fine meal that can be moulded without your hands.\n\n🌱Pack the crust down into a greased muffin tin and set aside\n\n👌Make the filling by blending together all ingredients until smooth. Pour half of the mix into the muffin tins and reserve half for the blueberry layer\n\n🦄Blend in the blueberries until smooth then layer on top of the muffin tins.\n\n🧊Freeze for 3 hours minimum and bring out 10 minutes before you want to eat them!",
    "image": "http://localhost:5000/uploads/1748020638286.jpg",
    "id": 7
  },
  {
    "title": "One Pot Creamy Tuscan Bean And Sun-Dried Tomato Skillet",
    "ingredients": "2 tablespoons olive oil\n1 large onion diced\n4 garlic cloves minced\n1 teaspoon tomato paste\n1 tablespoon Italian seasoning\nSalt and pepper to taste\n1 cup heavy cream or full-fat coconut milk or 240 ml\n7 ounces sun-dried tomatoes chopped ( or 200 g)\n17.6 ounces cannellini beans drained and rinsed (or 500 g)\nA handful of baby spinach\nChili oil for topping\nSourdough bread for serving",
    "instructions": "In a large pan, heat the olive oil over medium heat.\nAdd the diced onion and minced garlic together. Sauté for about 5-7 minutes, until the onion is translucent and the garlic is fragrant.\nStir in the tomato paste and cook for about 1 minute, until well combined.\nAdd the Italian seasoning, salt, and pepper to taste. Stir to mix.\nPour in the heavy cream or full-fat coconut milk, stirring continuously until well mixed.\nAdd the chopped sun-dried tomatoes and stir to combine. Cook for about 5 minutes, stirring occasionally.\nAdd the drained and rinsed cannellini beans, and stir to combine. Cook for another 5 minutes, stirring occasionally.\nContinue to cook, stirring occasionally, for about 10 minutes, or until the sauce has thickened to your desired consistency.\nOnce the sauce is thickened, add the baby spinach. Stir for about 2-3 minutes, until the spinach is wilted.\nTop with chili oil and serve with slices of sourdough bread.",
    "image": "http://localhost:5000/uploads/1748020784189.jpg",
    "id": 8
  },
  {
    "title": "Coconut Lime Tofu!",
    "ingredients": "Remove the tofu and set aside. In the same pan, stir in:\n- 1 tbsp sesame oil\n- 1/2 onion, sliced\n- 3-4 cloves of garlic , minced\n- Knob of ginger, grated\n- 1-2 tbsp red curry paste (let me know if you want my homemade paste recipe)\n- 1-2 tbsp sriracha/ hot sauce\nStir it together and once fragrant, add 250-300 ml coconut milk , then stir in:\n- 1-2 tsp brown sugar\n- 1-2 tbsp light soy sauce\n- Juice of 1/2 - 1 lemon or lime (adjust according to preference, adding more for zing)\n",
    "instructions": "This one is set to convert all tofu sceptics - it’s so rich and creamy, but balanced by zingy, fiery flavours that you’ll be sopping up with a bowl of rice. Make it now and I promise your soul will be thanking you later , as this is all kinds of cosy and comforting!  Gently heat 1-2 tbsp of sesame oil/ any oil of choice in a pan. Pan-fry silken-firm/ firm tofu slices until golden brown on both sides (flipping half way). Optional: - coat the tofu slices lightly in corn flour for a more crisp and golden texture. - If using silken-firm tofu, it is recommended to wrap the block between kitchen towels (placing a small saucepan on top). Let it sit for 10-15 minutes or so to drain out the excess water. Then pat tofu dry with clean kitchen towels and slice it. ",
    "image": "http://localhost:5000/uploads/1748020900377.jpg",
    "id": 9
  },
  {
    "title": "Banana Monkey Bread",
    "ingredients": "2 ¾ cups Self-rising Flour\n2 tablespoons Cinnamon\n¼ cup Coconut Sugar\n1 ½ cup Mashed Ripe Bananas equivalent to 3 large bananas 1 Banana optional, to slice on top Sauce\n¼ cup Avocado Oil\n¼ cup Coconut Sugar",
    "instructions": "Preheat the oven to 350 °F (180 °C). Line a 9-inch x 5-inch loaf pan with parchment paper. Slightly oil paper with cooking oil spray.\nIn a small bowl, stir coconut sugar with cinnamon. Set it aside.\nMash the banana in a mixing bowl and make sure you pack the mashed banana in your measuring cups after sweeping off the excess to precisely measure 1 1/2 cups. Return to the bowl.\nStir in self-rising flour with a rubber spatula. When it starts to look crumbly, use your hands to knead and press the dough together. It will be very sticky, which is normal. Keep kneading until it forms a ball of dough.\nClean your hands, oil them with avocado oil, and rub some oil on your work surface and all around the dough.\nDivide the dough into balls - they don't have to be perfect, but roughly the same size - about the size of a golf ball. Set aside.\nRoll each dough ball into the cinnamon sugar prepared before.\nPlace the dough balls in the prepared loaf pan. Arrange them next to each other to form a first layer, then stack them up in the pan until all the balls are in the pan.\nIn another bowl, stir the coconut sugar and avocado oil. The mixture will resemble a slightly liquid paste.\nDrizzle this paste on top of the bread and in the holes between the dough balls so it runs down the pan and forms a caramel layer when baking.\nIf you like, add banana slices on top of the bread.\nBake on the center rack of the oven for 35 minutes at 350 °F (180 °C) until golden brown and puffy.\nFlip the bread upside down on a wooden board and let it cool down to room temperature.\nServe plain or with a drizzle of vegan royal icing.",
    "image": "http://localhost:5000/uploads/1748021026894.jpg",
    "id": 10
  },
  {
    "title": "Coconut Banana Cookies",
    "ingredients": "½ cup Banana\n¾ cup Desiccated Coconut\n1 tablespoon Coconut Flour\nOptional drizzle\n⅓ cup Dark Chocolate Chips\n1 teaspoon Coconut Oil",
    "instructions": "Preheat the oven to 350°F (180°C). Line a large baking sheet with parchment paper. Lightly oil with cooking oil spray. Set aside.\nIn a mixing bowl, add the banana, mash it into a puree using a fork. Pack the mashed banana in a measuring cup (1/2 cup) and sweep off the excess.\nReturn the 1/2 cup mashed banana to the bowl and stir with desiccated coconut and coconut flour until the dough comes together. It should be moist but hold its shape nicely if you form a golf-sized ball with it. If it is too runny, sprinkle more coconut flour, 1/2 teaspoon at a time, and stir until the dough is easy to shape.\nUsing a small cookie dough scoop, grab some dough, pack in the scoop, and release it on the prepared baking sheet to form small mounds of coconut.\nLeave a thumb of space between each coconut banana cookie.\nBake on the rack just under the center rack for 15 minutes or until lightly golden brown on top and edges.\nCool down on a cooling rack before drizzling melted chocolate on top .",
    "image": "http://localhost:5000/uploads/1748021134012.jpg",
    "id": 11
  },
  {
    "title": "Banana Donut Holes",
    "ingredients": "½ cup Banana 1 large banana\n¾ cup Self-Rising Flour\nCoating - to make them taste like donuts!\n½ teaspoon Cinnamon\n¼ cup Sugar\n2 tablespoons Coconut Oil melted, or melted vegan butter",
    "instructions": "Mash the banana into a smooth puree, make sure you get 1/2 cup or the donut batter won't come together with the same ratio of flour.\nStir in the flour and knead the dough until it looks like pizza dough but is a bit stickier and moist. I found it easier to use a silicone spatula at first, then, when it starts to form lumps, knead with your slightly oiled hands. Or simply use the paddle attachment of a stand mixer, and the dough comes together in 1 minute on speed 4. If the dough looks too dry, simply add a bit more mashed banana. If too wet, sprinkle more flour.\nGrease your hand with coconut oil, grab about a tablespoon of dough, roll it into a ball, and place it on a plate covered with parchment paper. Repeat until all the dough has been turned into balls. Spray avocado oil on top of the balls.\nSpray oil in the air fryer basket and place the oiled donut holes in the basket, leaving 1 inch (3 cm) apart as they expand.\nAir fry at 350°F (180°C) for 6-7 minutes or until puffy and golden brown. They will have a rocky shape and be dry outside, and some will not be as round as balls; that's normal.\nTo make these banana bread balls taste like donuts, brush each warm ball with melted coconut oil using a pastry brush. Then, roll the warm, oiled balls into cinnamon sugar to coat evenly.\nServe warm immediately.",
    "image": "http://localhost:5000/uploads/1748639068473.jpg",
    "id": 13
  },
  {
    "title": "Tiramisu chia pudding",
    "ingredients": "1/2 cup / 86g chia seeds\n2 tbsp maple syrup\n1/2 tsp vanilla bean extract\n1.5 cup / 325ml plant milk\none espresso shot coffee (I used decaf)\n1.5 cup / 310g vegan yogurt\n1 tsp cocoa powder\n1/2 cup / 86g chia seeds\n2 tbsp maple syrup\n1/2 tsp vanilla bean extract\n1.5 cup / 325ml plant milk\none espresso shot coffee (I used decaf)\n1.5 cup / 310g vegan yogurt\n1 tsp cocoa powder",
    "instructions": "1. Combine your chia seeds, milk, espresso shot, maple syrup, vanilla, and 1 cup/ 230g yogurt.\n2. Place into cups/ jars and leave to set for at least 2 hours or overnight.\n3. Once ready to eat, finish with the remaining yogurt and cocoa powder. Enjoy!",
    "image": "http://localhost:5000/uploads/1748639936486.jpg",
    "id": 14
  },
  {
    "title": "Lemon and Blueberry Chia Pudding",
    "ingredients": "1/2 cup / 86g chia seeds\n2 tbsp maple syrup\n1/2 tsp lemon or vanilla extract\n1.5 cup / 325ml plant milk\n1/2 lemon - juice and zest\n1.5 cup / 310g vegan yogurt\n3/4 cup / 75g frozen blueberries",
    "instructions": "1. Combine your chia seeds, milk, maple syrup, extract, lemon zest + juice, and 1 cup/ 230g yogurt. Leave to set for at least 2 hours, or overnight.\n2. Put your frozen blueberries into a microwave for 1 minute, until they are fully defrosted and a sauce forms. You can do this on the stove if you would prefer. Place the blueberries into cups/ jars before adding the chia pudding on top. Finish with the rest of the yogurt and a little bit of lemon zest. Enjoy!",
    "image": "http://localhost:5000/uploads/1748640180680.jpg",
    "id": 15
  }
]